
## Plan Result (annotations-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/53704)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 4 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Update
  * aws_dynamodb_table.dynamodb_highlight-notes_dynamodb_table_8BD520BF
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
* Delete
  * aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446
  * aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2
  * aws_security_group.redis_elasticache_security_group_24BFB83E
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGet*",
              + "dynamodb:BatchWrite*",
              + "dynamodb:Delete*",
              + "dynamodb:DescribeTable",
              + "dynamodb:Get*",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:us-east-1:996905175585:table/ANNOT-Prod-highlight-notes",
              + "arn:aws:dynamodb:us-east-1:996905175585:table/ANNOT-Prod-highlight-notes/*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue",
            ]
        }
    }

  # aws_dynamodb_table.dynamodb_highlight-notes_dynamodb_table_8BD520BF will be updated in-place
  ~ resource "aws_dynamodb_table" "dynamodb_highlight-notes_dynamodb_table_8BD520BF" {
        id                          = "ANNOT-Prod-highlight-notes"
        name                        = "ANNOT-Prod-highlight-notes"
        tags                        = {
            "environment" = "Prod"
            "service"     = "AnnotationsAPI"
        }
        # (9 unchanged attributes hidden)

      - global_secondary_index {
          - hash_key           = "userId" -> null
          - name               = "userId" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "KEYS_ONLY" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
        }
      + global_secondary_index {
          + hash_key           = "userId"
          + name               = "userId"
          + non_key_attributes = []
          + projection_type    = "KEYS_ONLY"
          + read_capacity      = 5
          + write_capacity     = 5
        }

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/AnnotationsAPI-Prod:676" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/AnnotationsAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (9 unchanged elements hidden)
                        {
                            name  = "OTLP_COLLECTOR_HOST"
                            value = "localhost"
                        },
                      - {
                          - name  = "REDIS_PRIMARY_ENDPOINT"
                          - value = "annotationsapi-prod.zcx42u.ng.0001.use1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "REDIS_READER_ENDPOINT"
                          - value = "annotationsapi-prod-ro.zcx42u.ng.0001.use1.cache.amazonaws.com"
                        },
                        {
                            name  = "SQS_BATCH_DELETE_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue"
                        },
                    ]
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/annotationsapi-prod-app:49d0f87ef15de6c40be102d546d4120f152081c7" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/annotationsapi-prod-app:97cb6f73860803c79febf32cf0f1bc080ab586d4"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (8 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "AnnotationsAPI-Prod" -> (known after apply)
      ~ revision                 = 676 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "AnnotationsAPI"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446 will be destroyed
  # (because aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446 is not in configuration)
  - resource "aws_elasticache_replication_group" "redis_elasticache_replication_group_6DE00446" {
      - apply_immediately          = true -> null
      - arn                        = "arn:aws:elasticache:us-east-1:996905175585:replicationgroup:annotationsapi-prod" -> null
      - at_rest_encryption_enabled = false -> null
      - auth_token_update_strategy = "ROTATE" -> null
      - auto_minor_version_upgrade = "true" -> null
      - automatic_failover_enabled = true -> null
      - cluster_enabled            = false -> null
      - data_tiering_enabled       = false -> null
      - description                = "annotationsapi-prod | Managed by terraform" -> null
      - engine                     = "redis" -> null
      - engine_version             = "7.0" -> null
      - engine_version_actual      = "7.0.7" -> null
      - id                         = "annotationsapi-prod" -> null
      - ip_discovery               = "ipv4" -> null
      - maintenance_window         = "mon:03:00-mon:04:00" -> null
      - member_clusters            = [
          - "annotationsapi-prod-001",
          - "annotationsapi-prod-002",
        ] -> null
      - multi_az_enabled           = true -> null
      - network_type               = "ipv4" -> null
      - node_type                  = "cache.t3.micro" -> null
      - num_cache_clusters         = 2 -> null
      - num_node_groups            = 1 -> null
      - parameter_group_name       = "default.redis7" -> null
      - port                       = 6379 -> null
      - primary_endpoint_address   = "annotationsapi-prod.zcx42u.ng.0001.use1.cache.amazonaws.com" -> null
      - reader_endpoint_address    = "annotationsapi-prod-ro.zcx42u.ng.0001.use1.cache.amazonaws.com" -> null
      - replicas_per_node_group    = 1 -> null
      - replication_group_id       = "annotationsapi-prod" -> null
      - security_group_ids         = [
          - "sg-069d0b4a10e773a7b",
        ] -> null
      - security_group_names       = [] -> null
      - snapshot_retention_limit   = 0 -> null
      - snapshot_window            = "10:00-11:00" -> null
      - subnet_group_name          = "annotationsapi-prod-elasticachesubnetgroup" -> null
      - tags                       = {
          - "environment" = "Prod"
          - "service"     = "AnnotationsAPI"
        } -> null
      - tags_all                   = {
          - "environment" = "Prod"
          - "service"     = "AnnotationsAPI"
        } -> null
      - transit_encryption_enabled = false -> null
      - user_group_ids             = [] -> null
    }

  # aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2 will be destroyed
  # (because aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2 is not in configuration)
  - resource "aws_elasticache_subnet_group" "redis_elasticache_subnet_group_EA2B92B2" {
      - arn         = "arn:aws:elasticache:us-east-1:996905175585:subnetgroup:annotationsapi-prod-elasticachesubnetgroup" -> null
      - description = "Managed by Terraform" -> null
      - id          = "annotationsapi-prod-elasticachesubnetgroup" -> null
      - name        = "annotationsapi-prod-elasticachesubnetgroup" -> null
      - subnet_ids  = [
          - "subnet-610bdb3b",
          - "subnet-b2a036fa",
          - "subnet-cc66bde0",
          - "subnet-d09eb8ec",
        ] -> null
      - tags        = {
          - "environment" = "Prod"
          - "service"     = "AnnotationsAPI"
        } -> null
      - tags_all    = {
          - "environment" = "Prod"
          - "service"     = "AnnotationsAPI"
        } -> null
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be updated in-place
  ~ resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
        id        = "arn:aws:iam::996905175585:policy/AnnotationsAPI-Prod-TaskRolePolicy"
        name      = "AnnotationsAPI-Prod-TaskRolePolicy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:Get*",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:Delete*",
                          - "dynamodb:BatchWrite*",
                          - "dynamodb:BatchGet*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:996905175585:table/ANNOT-Prod-highlight-notes/*",
                          - "arn:aws:dynamodb:us-east-1:996905175585:table/ANNOT-Prod-highlight-notes",
                        ]
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessageBatch",
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:996905175585:AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "environment" = "Prod"
            "service"     = "AnnotationsAPI"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.redis_elasticache_security_group_24BFB83E will be destroyed
  # (because aws_security_group.redis_elasticache_security_group_24BFB83E is not in configuration)
  - resource "aws_security_group" "redis_elasticache_security_group_24BFB83E" {
      - arn                    = "arn:aws:ec2:us-east-1:996905175585:security-group/sg-069d0b4a10e773a7b" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-069d0b4a10e773a7b" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = ""
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6379
            },
        ] -> null
      - name                   = "AnnotationsAPI-Prod20220208003812583500000006" -> null
      - name_prefix            = "AnnotationsAPI-Prod" -> null
      - owner_id               = "996905175585" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "environment" = "Prod"
          - "service"     = "AnnotationsAPI"
        } -> null
      - tags_all               = {
          - "environment" = "Prod"
          - "service"     = "AnnotationsAPI"
        } -> null
      - vpc_id                 = "vpc-867638e3" -> null
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 2 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"eb489181-e874-41be-9791-e3026e62548c","JobName":"annotations-api_infrastructure_plan_prod","PRNumber":191,"Program":"tfcmt","SHA1":"97cb6f73860803c79febf32cf0f1bc080ab586d4","Target":"annotations-api-cdk","Vars":{}} -->